Revit 2026 API

# ExternalResourceLoadData Methods

---

The ExternalResourceLoadData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetExternalResourceReference | Returns the ExternalResourceReference that identifies which resource should be loaded. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetLoadContent | Returns the ExternalResourceLoadContent resulting from this load operation. |
|  | GetLoadContext | Returns an object containing information about the context of the load operation. |
|  | GetLoadRequestId | Returns the load operation GUID. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

ExternalResourceLoadData Class

Autodesk.Revit.DB Namespace